{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "ad hominem",
    "1": "ad populum",
    "2": "appeal to emotion",
    "3": "circular reasoning",
    "4": "equivocation",
    "5": "fallacy of credibility",
    "6": "fallacy of extension",
    "7": "fallacy of logic",
    "8": "fallacy of relevance",
    "9": "false causality",
    "10": "false dilemma",
    "11": "faulty generalization",
    "12": "intentional"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "is_decoder": false,
  "label2id": {
    "ad hominem": 0,
    "ad populum": 1,
    "appeal to emotion": 2,
    "circular reasoning": 3,
    "equivocation": 4,
    "fallacy of credibility": 5,
    "fallacy of extension": 6,
    "fallacy of logic": 7,
    "fallacy of relevance": 8,
    "false causality": 9,
    "false dilemma": 10,
    "faulty generalization": 11,
    "intentional": 12
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
